            //3
// Написать функцию, которая принимает число как аргумент и возвращает функцию, 
// которая также принимает число как аргумент и возвращает сумму этих двух чисел. 
// Выведите в консоль результат.
// ==========================================================================================
function sum(numOne){
    return function(numTwo){
        return numOne + numTwo;
    }
}
let sum10 = sum(10);
console.log(sum10(1));
// ==========================================================================================