            //4
// Напишите функцию, которая принимает два числа. 
// Каждую секунду необходимо выводить в консоль, начиная от первого и заканчивая вторым. 
// Используйте setInterval.
// ==========================================================================================
let numOne = prompt("Введите первое число")
numOne = parseInt(numOne);
let numTwo = prompt("Введите второе число")
function nums(a, b) {
    const intervalId = setInterval(function() {
    console.log(a++);
    if(a > b)  clearInterval(intervalId);
    }, 1000)
}
nums(numOne, numTwo);
// ==========================================================================================